In [0]:
# Author : Karthikeyan V
# Stack Overflow Case Study
# import the Python Libraries
import pandas as pd
import numpy as py
import matplotlib.pyplot as plt

**Data Collection**

Get the data from public S3 Storage to perform EDA

In [0]:
# read the Questions Dataset stored in AWS S3 public storage 
inpQues = pd.read_csv("https://stack-overflow-casestudy-datasets.s3.amazonaws.com/Questions.csv", encoding="ISO-8859-1")

In [0]:
# read the Question Tags Dataset stored in AWS S3 public storage
inpQuesTags = pd.read_csv("https://stack-overflow-casestudy-datasets.s3.amazonaws.com/Tags.csv", encoding="ISO-8859-1")

In [0]:
# read the Answers Dataset stored in AWS S3 public storage 
inpAns = pd.read_csv("https://stack-overflow-casestudy-datasets.s3.amazonaws.com/Answers.csv", encoding="ISO-8859-1")

In [0]:
# read the Users Dataset stored in AWS S3 public storage 
inpUsers = pd.read_csv("https://stack-overflow-casestudy-datasets.s3.amazonaws.com/Users.csv", encoding="ISO-8859-1")

**EDA on Question Data Set**

*   Identify the data types on the Data Sets
CreationDate and ClosedDate columns are not dates. Convert them into 

*   List item
*   List item


Dates

In [40]:
inpQues.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1264216 entries, 0 to 1264215
Data columns (total 8 columns):
Id               1264216 non-null int64
OwnerUserId      1264216 non-null float64
CreationDate     1264216 non-null datetime64[ns, UTC]
ClosedDate       55959 non-null datetime64[ns, UTC]
Score            1264216 non-null int64
Title            1264216 non-null object
Body             1264216 non-null object
IsQuesionOpen    1264216 non-null object
dtypes: datetime64[ns, UTC](2), float64(1), int64(2), object(3)
memory usage: 77.2+ MB

In [36]:
inpQuesTags.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3750994 entries, 0 to 3750993
Data columns (total 2 columns):
Id     int64
Tag    object
dtypes: int64(1), object(1)
memory usage: 57.2+ MB

In [34]:
inpAns.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2014516 entries, 0 to 2014515
Data columns (total 6 columns):
Id              int64
OwnerUserId     float64
CreationDate    object
ParentId        int64
Score           int64
Body            object
dtypes: float64(1), int64(3), object(2)
memory usage: 92.2+ MB

In [35]:
inpUsers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1990480 entries, 0 to 1990479
Data columns (total 9 columns):
Unnamed: 0          int64
id                  int64
display_name        object
creation_date       object
last_access_date    object
reputation          int64
up_votes            int64
down_votes          int64
views               int64
dtypes: int64(6), object(3)
memory usage: 136.7+ MB

In [8]:
inpQues.head(5)

    Id  ...                                               Body
0   80  ...  <p>I've written a database generation script i...
1   90  ...  <p>Are there any really good tutorials explain...
2  120  ...  <p>Has anyone got experience creating <strong>...
3  180  ...  <p>This is something I've pseudo-solved many t...
4  260  ...  <p>I have a little game written in C#. It uses...

[5 rows x 7 columns]

In [37]:
inpAns.head(5)

    Id  OwnerUserId  ... Score                                               Body
0   92         61.0  ...    13  <p><a href="http://svnbook.red-bean.com/">Vers...
1  124         26.0  ...    12  <p>I wound up using this. It is a kind of a ha...
2  199         50.0  ...     1  <p>I've read somewhere the human eye can't dis...
3  269         91.0  ...     4  <p>Yes, I thought about that, but I soon figur...
4  307         49.0  ...    28  <p><a href="http://www.codeproject.com/Article...

[5 rows x 6 columns]

In [38]:
inpQuesTags.head(5)

   Id             Tag
0  80            flex
1  80  actionscript-3
2  80             air
3  90             svn
4  90     tortoisesvn

In [39]:
inpUsers.head(5)

   Unnamed: 0  id display_name  ... up_votes down_votes  views
0           0  26        Shawn  ...      565         67   3547
1           1  26        Shawn  ...      565         67   3547
2           2  26        Shawn  ...      565         67   3547
3           3  26        Shawn  ...      565         67   3547
4           4  26        Shawn  ...      565         67   3547

[5 rows x 9 columns]

In [45]:
# Question Data Set - Null Checks
inpQues.isnull().sum()/len(inpQues)*100

Id                0.00000
OwnerUserId       0.00000
CreationDate      0.00000
ClosedDate       95.57362
Score             0.00000
Title             0.00000
Body              0.00000
IsQuesionOpen     0.00000
dtype: float64

In [46]:
# Display the Question records whose  OwnerUserId is null
inpQues[inpQues["OwnerUserId"].isnull()]

Empty DataFrame
Columns: [Id, OwnerUserId, CreationDate, ClosedDate, Score, Title, Body, IsQuesionOpen]
Index: []

In [12]:
# Display the Question records whose  ClosedDate is null
inpQues[inpQues["ClosedDate"].isnull()]

               Id  ...                                               Body
0              80  ...  <p>I've written a database generation script i...
2             120  ...  <p>Has anyone got experience creating <strong>...
3             180  ...  <p>This is something I've pseudo-solved many t...
4             260  ...  <p>I have a little game written in C#. It uses...
5             330  ...  <p>I am working on a collection of classes use...
...           ...  ...                                                ...
1264211  40143210  ...  <p>I am building a custom MVC project and I ha...
1264212  40143300  ...  <p>The API docs show that you should be able t...
1264213  40143340  ...  <p>Under minifyEnabled I changed from false to...
1264214  40143360  ...  <p>I have input which I use to filter my array...
1264215  40143380  ...  <p>I'm running a mocha test and I noticed my c...

[1208257 rows x 7 columns]

In [0]:
# Convert the CreationDate into DateTime Object so that we can perform data analysis based on date/time values
inpQues['CreationDate']=pd.to_datetime(inpQues['CreationDate'])

In [0]:
# Convert the ClosedDate into DateTime Object so that we can perform data analysis based on date/time values
inpQues['ClosedDate']=pd.to_datetime(inpQues['ClosedDate'])

In [24]:
# Before removing the NaN values from OwnerUserId column, impute the value as zero so that we can decide later whether this can be dropped or not
# Before imputing check if there are any records with OwnerUserId = 0
inpQues[inpQues.OwnerUserId == 0]

Empty DataFrame
Columns: [Id, OwnerUserId, CreationDate, ClosedDate, Score, Title, Body, IsQuesionOpen]
Index: []

In [0]:
# Before removing the NaN values from OwnerUserId column, impute the value as zero so that we can decide later whether this can be dropped or not
inpQues["OwnerUserId"].fillna(0, inplace = True)

In [54]:
inpQues[inpQues.OwnerUserId == 0]

               Id  ...  IsQuesionOpen
47           4170  ...              Y
130         12330  ...              Y
158         15190  ...              Y
198         18250  ...              Y
300         29100  ...              Y
...           ...  ...            ...
1261359  40076260  ...              Y
1261501  40079260  ...              Y
1263664  40130890  ...              N
1263908  40136590  ...              N
1264010  40138620  ...              N

[14454 rows x 8 columns]

In [52]:
# Convert the OwnerUserId into int so that it matches with the datatype in the Users dataset
inpQues.OwnerUserId.astype('int32')

0               26
1               58
2               83
3          2089740
4               91
            ...
1264211    5610777
1264212    3791161
1264213    7028647
1264214     871677
1264215    6823982
Name: OwnerUserId, Length: 1264216, dtype: int32

In [53]:
inpQues.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1264216 entries, 0 to 1264215
Data columns (total 8 columns):
Id               1264216 non-null int64
OwnerUserId      1264216 non-null float64
CreationDate     1264216 non-null datetime64[ns, UTC]
ClosedDate       55959 non-null datetime64[ns, UTC]
Score            1264216 non-null int64
Title            1264216 non-null object
Body             1264216 non-null object
IsQuesionOpen    1264216 non-null object
dtypes: datetime64[ns, UTC](2), float64(1), int64(2), object(3)
memory usage: 77.2+ MB

In [0]:
# Create a new column to identify which are the Open questions from the dataset that doesn't have a closed date. We can identify the questions that are still not closed yet
inpQues['IsQuesionOpen'] = inpQues.apply(lambda row: "N" if pd.notnull(row.ClosedDate) else "Y", axis=1)

In [0]:
inpQues.info()

In [0]:
# Impute in a new column whether the Question belongs to the DataScience Category or not in the Questions DataSet
# Concat the DataScience Tags together in the Questions DataSet
# Identify the Questions till open related to DataScience Tags
# Identify the Questions till open with specific DataScience Tag

In [32]:
inpQues.head(5)

    Id  ...  IsQuesionOpen
0   80  ...              Y
1   90  ...              N
2  120  ...              Y
3  180  ...              Y
4  260  ...              Y

[5 rows x 8 columns]

In [0]:
inpQuesTagsDataScience = inpQuesTags[(inpQuesTags.values  == "r")|(inpQuesTags.values  == "matlab")|(inpQuesTags.values  == "excel")|(inpQuesTags.values  == "sql")|(inpQuesTags.values  == "sas")|(inpQuesTags.values  == "python")]

In [0]:
inpQuesTagsDataScience.head(5)

               Id    Tag
898238   11215790  excel
2923961  32753460  excel
2196811  25320370  excel
1962718  22872800  excel
2409386  27544840  excel

In [0]:
inpQuesTags["Tag"].value_counts()

javascript                124155
java                      115212
c#                        101186
php                        98808
android                    90659
                           ...
alassetsgroup                  1
string-externalization         1
uppaal                         1
msbuild-buildengine            1
jsontemplate                   1
Name: Tag, Length: 37034, dtype: int64

In [0]:
inpQuesTags.sort_values("Tag", axis = 0, ascending = True, inplace = True, na_position ='last')

In [0]:
inpQuesTags.head(5)

               Id Tag
152175    2488400  .a
1266993  15292510  .a
1233097  14914830  .a
1931670  22547340  .a
2319123  26600100  .a

In [0]:
inpQuesTagsDataScience = inpQuesTags[(inpQuesTags.values  == "r")|(inpQuesTags.values  == "matlab")|(inpQuesTags.values  == "excel")|(inpQuesTags.values  == "sql")|(inpQuesTags.values  == "sas")|(inpQuesTags.values  == "python")]

In [0]:
inpQuesTagsDataScience.Tag.value_counts()

python    64601
sql       35782
r         15701
excel     10384
matlab     6495
sas         697
Name: Tag, dtype: int64

In [0]:
inpQuesTagsDataScience.count

<bound method DataFrame.count of                Id    Tag
898238   11215790  excel
2923961  32753460  excel
2196811  25320370  excel
1962718  22872800  excel
2409386  27544840  excel
...           ...    ...
3474469  37760450    sql
1831498  21498360    sql
855516   10744200    sql
3474405  37759790    sql
1205036  14602960    sql

[133660 rows x 2 columns]>

In [0]:
inpQuesTagsDataScience.head(15)

               Id    Tag
898238   11215790  excel
2923961  32753460  excel
2196811  25320370  excel
1962718  22872800  excel
2409386  27544840  excel
1492966  17797320  excel
2468255  28158200  excel
2727584  30787030  excel
3703057  39765330  excel
2924120  32755050  excel
2721377  30726180  excel
1327788  15969390  excel
3391181  37013580  excel
2719605  30708010  excel
2721964  30732020  excel

In [0]:
inpQuesTagsDataScience[inpQuesTagsDataScience.Tag.isnull()]

Empty DataFrame
Columns: [Id, Tag]
Index: []

In [0]:
inpQuesTagsDataScience.tail(15)

               Id  Tag
1274180  15371920  sql
3474753  37762720  sql
892464   11150990  sql
1910888  22330450  sql
3474613  37761620  sql
818404   10335510  sql
1278972  15425740  sql
1831669  21500180  sql
133437    2238570  sql
892471   11151030  sql
3474469  37760450  sql
1831498  21498360  sql
855516   10744200  sql
3474405  37759790  sql
1205036  14602960  sql

In [0]:
inpQuesTagsDataScience.Id.value_counts()

40027330    3
31948740    3
8457110     3
10522290    3
18369820    3
           ..
36866180    1
35035270    1
14608520    1
12574700    1
2621440     1
Name: Id, Length: 132075, dtype: int64

In [0]:
inpQuesTagsDataScience.loc[inpQuesTagsDataScience['Id'] == 35918200]

               Id     Tag
3269827  35918200  matlab
3269825  35918200  python
3269826  35918200       r

In [0]:
inpQuesTagsDataScience.loc[inpQuesTagsDataScience['Id'] == 29325500]

               Id     Tag
2582988  29325500   excel
2582989  29325500  matlab
2582987  29325500       r

In [0]:
inpQuesTagsDataScience.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 133660 entries, 898238 to 1205036
Data columns (total 2 columns):
Id     133660 non-null int64
Tag    133660 non-null object
dtypes: int64(1), object(1)
memory usage: 3.1+ MB

In [0]:
inpQuesTagsDataScience.loc[inpQuesTagsDataScience['Id'] == 26115210].Tag.values.tolist()

['excel', 'matlab', 'sql']

In [0]:
inpQuesTagsDataScience.Tag.value_counts()

python    64601
sql       35782
r         15701
excel     10384
matlab     6495
sas         697
Name: Tag, dtype: int64

In [0]:
inpQuesTagsDataScience.head(5)

               Id    Tag
898238   11215790  excel
2923961  32753460  excel
2196811  25320370  excel
1962718  22872800  excel
2409386  27544840  excel

In [0]:
inpUsers.tail(5)

         Unnamed: 0       id      display_name  ... up_votes down_votes  views
1990475     1990475  4228492  Michael Spranger  ...      112          2     17
1990476     1990476  6820506           Manuela  ...       38          0     50
1990477     1990477  4464432            YTorii  ...       67          1     13
1990478     1990478  4605946     space_voyager  ...       53          1    191
1990479     1990479  6107989         Nicky HFE  ...        0          0     30

[5 rows x 9 columns]

In [0]:
inpUsers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1990480 entries, 0 to 1990479
Data columns (total 8 columns):
id                  int64
display_name        object
creation_date       object
last_access_date    object
reputation          int64
up_votes            int64
down_votes          int64
views               int64
dtypes: int64(5), object(3)
memory usage: 121.5+ MB

In [0]:
inpUsers.head(5)

   id display_name               creation_date  ... up_votes  down_votes  views
0  26        Shawn  2008-08-01 12:18:14.52 UTC  ...      565          67   3547
1  26        Shawn  2008-08-01 12:18:14.52 UTC  ...      565          67   3547
2  26        Shawn  2008-08-01 12:18:14.52 UTC  ...      565          67   3547
3  26        Shawn  2008-08-01 12:18:14.52 UTC  ...      565          67   3547
4  26        Shawn  2008-08-01 12:18:14.52 UTC  ...      565          67   3547

[5 rows x 8 columns]

In [0]:
del inpUsers['Unnamed: 0']

In [0]:
inpUsers.drop_duplicates(keep='first',inplace=True)

In [0]:
inpUsers.head(5)

        id display_name  ... down_votes views
0       26        Shawn  ...         67  3547
27    1109         Theo  ...        136  6905
85  364174        stats  ...          1    60
87      61      Bernard  ...        219  1731
97   20709  Black Horus  ...          2    96

[5 rows x 8 columns]